{"offers": ["Accepted Offer", "Accepted Offer", "Accepted Offer", "No Offer", "No Offer"], "experience": [100, 0], "difficulty": "2.6", "comments": ["Very relaxed and open ended, be sure to sell yourself and highlight strengths.\n\nKnow why you want to enter the field of Actuaries and know about the exams you have to take.", "Very relaxed and casual. Interviewers were friendly and dint try to stump you with any questions. Everything was straightforward and behavioral. No need to stress over an interview of this type as they simply want to learn more about you.", "After I applied through my university, I was given an interview at their office downtown. The interview was two rounds on the same day. Each of the interviews were about 45min/1hour. The interview questions were mainly behavioral, and some brain-teaser/technical questions. Overall fairly straightforward. I received a call back about a week or two later from the recruiter notifying me that I received the internship offer.", "The process was very quick. I talked to a recruiter at a career fair briefly and handed him my resume. Two weeks later I got a call asking me to come to Boston for a on-site interview. During the day, you interview with 4 people and then go to lunch with someone else. Overall, most of the questions were pretty straightforward. They are just trying to learn more about you…  and what type of worker you will be.", "Interviewed with 4 managers. The HR part of the interview at the end seemed a little rushed. I appreciated have time for 1 on one discussions at lunch which gave me a good feel for the company. I felt it looked like a good company to work for and even though I was not offered a job from that interview I was was going to keep applying for other jobs…  but got an offer elsewhere so that ended my job search"], "questions": ["Describe a past challenge?  ", "How would you describe an actuary to someone who has never heard of one before?  ", "Name a time where a group member was not performing up to standards and how did you resolve it?  ", "In the future, do you see yourself becoming a manager or a specialist in one area?  ", "They were interested in technicals skills and products I worked on. The LTC area seemed to be an area where there was opportunity for someone with detailed expertise in pricing valuation and review of experience data.  "], "path": [["Campus Recruiting", "40"], ["Applied Online", "40"], ["Recruiter", "20"]]}